docs: デモ環境手順書のダイアグラムを PlantUML に変更
